blkburn/openthread-CoAP/thread_sensor_cc2652/Debug/configPkg/package/cfg/release_pem4f.c
/*
 * ======== xdc.runtime.System_SupportProxy PROXY BODY ========
 */

/* DELEGATES TO xdc.runtime.SysCallback */

/* Module__startupDone__S */
xdc_Bool xdc_runtime_System_SupportProxy_Module__startupDone__S(void)
{
    return xdc_runtime_SysCallback_Module__startupDone__S();
}

/* abort__E */
xdc_Void xdc_runtime_System_SupportProxy_abort__E( xdc_CString str )
{
    xdc_runtime_SysCallback_abort(str);
}

/* exit__E */
xdc_Void xdc_runtime_System_SupportProxy_exit__E( xdc_Int stat )
{
    xdc_runtime_SysCallback_exit(stat);
}

/* flush__E */
xdc_Void xdc_runtime_System_SupportProxy_flush__E( void )
{
    xdc_runtime_SysCallback_flush();
}

/* putch__E */
xdc_Void xdc_runtime_System_SupportProxy_putch__E( xdc_Char ch )
{
    xdc_runtime_SysCallback_putch(ch);
}

/* ready__E */
xdc_Bool xdc_runtime_System_SupportProxy_ready__E( void )
{
    return xdc_runtime_SysCallback_ready();
}


/*
 * ======== ti.sysbios.family.arm.cc26xx.Timer OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_family_arm_cc26xx_Timer_Object2__ s0; char c; } ti_sysbios_family_arm_cc26xx_Timer___S1;
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Timer_Object__DESC__C, ".const:ti_sysbios_family_arm_cc26xx_Timer_Object__DESC__C");
__FAR__ const xdc_runtime_Core_ObjDesc ti_sysbios_family_arm_cc26xx_Timer_Object__DESC__C = {
    (xdc_CPtr)NULL, /* fxnTab */
    &ti_sysbios_family_arm_cc26xx_Timer_Module__root__V.link, /* modLink */
    sizeof(ti_sysbios_family_arm_cc26xx_Timer___S1) - sizeof(ti_sysbios_family_arm_cc26xx_Timer_Object2__), /* objAlign */
    0, /* objHeap */
    0, /* objName */
    sizeof(ti_sysbios_family_arm_cc26xx_Timer_Object2__), /* objSize */
    (xdc_CPtr)&ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C, /* prmsInit */
    sizeof(ti_sysbios_family_arm_cc26xx_Timer_Params), /* prmsSize */
};


/*
 * ======== ti.sysbios.family.arm.m3.Hwi OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_family_arm_m3_Hwi_Object2__ s0; char c; } ti_sysbios_family_arm_m3_Hwi___S1;


/*
 * ======== ti.sysbios.gates.GateHwi OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_gates_GateHwi_Object2__ s0; char c; } ti_sysbios_gates_GateHwi___S1;


/*
 * ======== ti.sysbios.gates.GateMutex OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_gates_GateMutex_Object2__ s0; char c; } ti_sysbios_gates_GateMutex___S1;


/*
 * ======== ti.sysbios.gates.GateMutexPri OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_gates_GateMutexPri_Object2__ s0; char c; } ti_sysbios_gates_GateMutexPri___S1;
#pragma DATA_SECTION(ti_sysbios_gates_GateMutexPri_Object__DESC__C, ".const:ti_sysbios_gates_GateMutexPri_Object__DESC__C");
__FAR__ const xdc_runtime_Core_ObjDesc ti_sysbios_gates_GateMutexPri_Object__DESC__C = {
    (xdc_CPtr)&ti_sysbios_gates_GateMutexPri_Module__FXNS__C, /* fxnTab */
    &ti_sysbios_gates_GateMutexPri_Module__root__V.link, /* modLink */
    sizeof(ti_sysbios_gates_GateMutexPri___S1) - sizeof(ti_sysbios_gates_GateMutexPri_Object2__), /* objAlign */
    0, /* objHeap */
    0, /* objName */
    sizeof(ti_sysbios_gates_GateMutexPri_Object2__), /* objSize */
    (xdc_CPtr)&ti_sysbios_gates_GateMutexPri_Object__PARAMS__C, /* prmsInit */
    sizeof(ti_sysbios_gates_GateMutexPri_Params), /* prmsSize */
};


/*
 * ======== ti.sysbios.hal.Hwi OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_hal_Hwi_Object2__ s0; char c; } ti_sysbios_hal_Hwi___S1;


/*
 * ======== ti.sysbios.heaps.HeapMem OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_heaps_HeapMem_Object2__ s0; char c; } ti_sysbios_heaps_HeapMem___S1;


/*
 * ======== ti.sysbios.heaps.HeapTrack OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_heaps_HeapTrack_Object2__ s0; char c; } ti_sysbios_heaps_HeapTrack___S1;
#pragma DATA_SECTION(ti_sysbios_heaps_HeapTrack_Object__DESC__C, ".const:ti_sysbios_heaps_HeapTrack_Object__DESC__C");
__FAR__ const xdc_runtime_Core_ObjDesc ti_sysbios_heaps_HeapTrack_Object__DESC__C = {
    (xdc_CPtr)&ti_sysbios_heaps_HeapTrack_Module__FXNS__C, /* fxnTab */
    &ti_sysbios_heaps_HeapTrack_Module__root__V.link, /* modLink */
    sizeof(ti_sysbios_heaps_HeapTrack___S1) - sizeof(ti_sysbios_heaps_HeapTrack_Object2__), /* objAlign */
    0, /* objHeap */
    0, /* objName */
    sizeof(ti_sysbios_heaps_HeapTrack_Object2__), /* objSize */
    (xdc_CPtr)&ti_sysbios_heaps_HeapTrack_Object__PARAMS__C, /* prmsInit */
    sizeof(ti_sysbios_heaps_HeapTrack_Params), /* prmsSize */
};


/*
 * ======== ti.sysbios.knl.Clock OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_knl_Clock_Object2__ s0; char c; } ti_sysbios_knl_Clock___S1;


/*
 * ======== ti.sysbios.knl.Event OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_knl_Event_Object2__ s0; char c; } ti_sysbios_knl_Event___S1;


/*
 * ======== ti.sysbios.knl.Mailbox OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_knl_Mailbox_Object2__ s0; char c; } ti_sysbios_knl_Mailbox___S1;


/*
 * ======== ti.sysbios.knl.Queue OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_knl_Queue_Object2__ s0; char c; } ti_sysbios_knl_Queue___S1;


/*
 * ======== ti.sysbios.knl.Semaphore OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_knl_Semaphore_Object2__ s0; char c; } ti_sysbios_knl_Semaphore___S1;


/*
 * ======== ti.sysbios.knl.Swi OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_knl_Swi_Object2__ s0; char c; } ti_sysbios_knl_Swi___S1;


/*
 * ======== ti.sysbios.knl.Task OBJECT DESCRIPTOR ========
 */

/* Object__DESC__C */
typedef struct { ti_sysbios_knl_Task_Object2__ s0; char c; } ti_sysbios_knl_Task___S1;


/*
 * ======== ROM STRUCTURES ========
 */

/* CT__constStruct */
typedef struct {
    CT__xdc_runtime_Error_policy xdc_runtime_Error_policy__R;
    xdc_runtime_Types_Base xdc_runtime_IModule_Interface__BASE__R;
    CT__xdc_runtime_Startup_lastFxns xdc_runtime_Startup_lastFxns__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Event_Object__DESC__R;
    CT__ti_sysbios_family_arm_m3_Hwi_excHookFuncs ti_sysbios_family_arm_m3_Hwi_excHookFuncs__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_gates_GateMutex_Object__DESC__R;
    CT__xdc_runtime_Startup_execImpl xdc_runtime_Startup_execImpl__R;
    xdc_SizeT ti_sysbios_gates_GateMutex_Instance_State_sem__O;
    ti_sysbios_heaps_HeapTrack_Fxns__ ti_sysbios_heaps_HeapTrack_Module__FXNS__R;
    CT__ti_sysbios_knl_Swi_Object__count ti_sysbios_knl_Swi_Object__count__R;
    CT__ti_sysbios_knl_Idle_funcList ti_sysbios_knl_Idle_funcList__R;
    CT__xdc_runtime_Text_isLoaded xdc_runtime_Text_isLoaded__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Clock_Object__DESC__R;
    CT__ti_sysbios_knl_Task_Module__id ti_sysbios_knl_Task_Module__id__R;
    xdc_SizeT ti_sysbios_knl_Mailbox_Instance_State_dataQue__O;
    CT__ti_sysbios_knl_Semaphore_eventSync ti_sysbios_knl_Semaphore_eventSync__R;
    ti_sysbios_gates_GateMutex_Fxns__ ti_sysbios_gates_GateMutex_Module__FXNS__R;
    xdc_SizeT ti_sysbios_knl_Task_Module_State_inactiveQ__O;
    CT__ti_sysbios_family_arm_m3_Hwi_Module__id ti_sysbios_family_arm_m3_Hwi_Module__id__R;
    CT__ti_sysbios_family_arm_cc26xx_Timer_Module__id ti_sysbios_family_arm_cc26xx_Timer_Module__id__R;
    CT__ti_sysbios_knl_Mailbox_Object__table ti_sysbios_knl_Mailbox_Object__table__R;
    CT__ti_sysbios_family_arm_m3_Hwi_Object__table ti_sysbios_family_arm_m3_Hwi_Object__table__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Swi_Object__DESC__R;
    CT__xdc_runtime_Text_charCnt xdc_runtime_Text_charCnt__R;
    CT__ti_sysbios_heaps_HeapTrack_A_bufOverflow ti_sysbios_heaps_HeapTrack_A_bufOverflow__R;
    CT__ti_sysbios_heaps_HeapMem_Object__table ti_sysbios_heaps_HeapMem_Object__table__R;
    CT__ti_sysbios_family_arm_cc26xx_Timer_funcHookCH1 ti_sysbios_family_arm_cc26xx_Timer_funcHookCH1__R;
    CT__xdc_runtime_Error_policyFxn xdc_runtime_Error_policyFxn__R;
    CT__ti_sysbios_family_arm_m3_Hwi_E_reserved ti_sysbios_family_arm_m3_Hwi_E_reserved__R;
    CT__ti_sysbios_heaps_HeapTrack_A_notEmpty ti_sysbios_heaps_HeapTrack_A_notEmpty__R;
    CT__xdc_runtime_Startup_firstFxns xdc_runtime_Startup_firstFxns__R;
    CT__xdc_runtime_Text_charTab xdc_runtime_Text_charTab__R;
    CT__ti_sysbios_family_arm_m3_TaskSupport_stackAlignment ti_sysbios_family_arm_m3_TaskSupport_stackAlignment__R;
    CT__ti_sysbios_family_arm_m3_Hwi_NUM_INTERRUPTS ti_sysbios_family_arm_m3_Hwi_NUM_INTERRUPTS__R;
    CT__ti_sysbios_knl_Clock_triggerClock ti_sysbios_knl_Clock_triggerClock__R;
    CT__ti_sysbios_knl_Swi_Object__table ti_sysbios_knl_Swi_Object__table__R;
    CT__xdc_runtime_Memory_Module__id xdc_runtime_Memory_Module__id__R;
    CT__ti_sysbios_knl_Swi_Module__id ti_sysbios_knl_Swi_Module__id__R;
    CT__xdc_runtime_SysCallback_flushFxn xdc_runtime_SysCallback_flushFxn__R;
    CT__ti_sysbios_heaps_HeapMem_Module__gateObj ti_sysbios_heaps_HeapMem_Module__gateObj__R;
    CT__ti_sysbios_family_arm_cc26xx_Timer_startupNeeded ti_sysbios_family_arm_cc26xx_Timer_startupNeeded__R;
    CT__ti_sysbios_family_arm_m3_Hwi_E_noIsr ti_sysbios_family_arm_m3_Hwi_E_noIsr__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Queue_Object__DESC__R;
    CT__ti_sysbios_family_arm_cc26xx_Timer_funcHookCH2 ti_sysbios_family_arm_cc26xx_Timer_funcHookCH2__R;
    CT__ti_sysbios_family_arm_m3_Hwi_E_NMI ti_sysbios_family_arm_m3_Hwi_E_NMI__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Task_Object__DESC__R;
    CT__xdc_runtime_Assert_E_assertFailed xdc_runtime_Assert_E_assertFailed__R;
    CT__ti_sysbios_gates_GateHwi_Module__id ti_sysbios_gates_GateHwi_Module__id__R;
    xdc_runtime_Types_Base xdc_runtime_IHeap_Interface__BASE__R;
    CT__xdc_runtime_SysCallback_exitFxn xdc_runtime_SysCallback_exitFxn__R;
    CT__ti_sysbios_heaps_HeapMem_Module__id ti_sysbios_heaps_HeapMem_Module__id__R;
    CT__ti_sysbios_family_arm_m3_Hwi_excHandlerFunc ti_sysbios_family_arm_m3_Hwi_excHandlerFunc__R;
    ti_sysbios_heaps_HeapMem_Fxns__ ti_sysbios_heaps_HeapMem_Module__FXNS__R;
    CT__ti_sysbios_family_arm_m3_Hwi_E_busFault ti_sysbios_family_arm_m3_Hwi_E_busFault__R;
    CT__xdc_runtime_System_maxAtexitHandlers xdc_runtime_System_maxAtexitHandlers__R;
    CT__ti_sysbios_knl_Queue_Object__count ti_sysbios_knl_Queue_Object__count__R;
    CT__xdc_runtime_Text_registryModsLastId xdc_runtime_Text_registryModsLastId__R;
    CT__ti_sysbios_knl_Task_Object__table ti_sysbios_knl_Task_Object__table__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Mailbox_Object__DESC__R;
    CT__ti_sysbios_family_arm_m3_Hwi_nullIsrFunc ti_sysbios_family_arm_m3_Hwi_nullIsrFunc__R;
    CT__ti_sysbios_knl_Clock_tickMode ti_sysbios_knl_Clock_tickMode__R;
    CT__ti_sysbios_gates_GateMutex_Module__id ti_sysbios_gates_GateMutex_Module__id__R;
    CT__ti_sysbios_knl_Swi_numPriorities ti_sysbios_knl_Swi_numPriorities__R;
    CT__ti_sysbios_knl_Task_numConstructedTasks ti_sysbios_knl_Task_numConstructedTasks__R;
    CT__xdc_runtime_Startup_maxPasses xdc_runtime_Startup_maxPasses__R;
    CT__ti_sysbios_knl_Task_initStackFlag ti_sysbios_knl_Task_initStackFlag__R;
    CT__xdc_runtime_System_abortFxn xdc_runtime_System_abortFxn__R;
    xdc_SizeT ti_sysbios_knl_Mailbox_Instance_State_dataSem__O;
    ti_sysbios_gates_GateHwi_Fxns__ ti_sysbios_gates_GateHwi_Module__FXNS__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_hal_Hwi_Object__DESC__R;
    CT__ti_sysbios_family_arm_m3_Hwi_priGroup ti_sysbios_family_arm_m3_Hwi_priGroup__R;
    CT__xdc_runtime_Error_E_memory xdc_runtime_Error_E_memory__R;
    CT__ti_sysbios_family_arm_m3_Hwi_E_alreadyDefined ti_sysbios_family_arm_m3_Hwi_E_alreadyDefined__R;
    xdc_SizeT ti_sysbios_knl_Mailbox_Instance_State_freeSem__O;
    CT__ti_sysbios_knl_Queue_Object__table ti_sysbios_knl_Queue_Object__table__R;
    CT__ti_sysbios_knl_Semaphore_eventPost ti_sysbios_knl_Semaphore_eventPost__R;
    CT__xdc_runtime_System_exitFxn xdc_runtime_System_exitFxn__R;
    CT__ti_sysbios_heaps_HeapTrack_A_doubleFree ti_sysbios_heaps_HeapTrack_A_doubleFree__R;
    CT__ti_sysbios_heaps_HeapMem_reqAlign ti_sysbios_heaps_HeapMem_reqAlign__R;
    CT__xdc_runtime_Startup_sfxnRts xdc_runtime_Startup_sfxnRts__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Semaphore_Object__DESC__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_gates_GateHwi_Object__DESC__R;
    CT__xdc_runtime_SysCallback_putchFxn xdc_runtime_SysCallback_putchFxn__R;
    CT__ti_sysbios_heaps_HeapMem_Object__count ti_sysbios_heaps_HeapMem_Object__count__R;
    CT__ti_sysbios_family_arm_m3_Hwi_numSparseInterrupts ti_sysbios_family_arm_m3_Hwi_numSparseInterrupts__R;
    CT__ti_sysbios_knl_Mailbox_maxTypeAlign ti_sysbios_knl_Mailbox_maxTypeAlign__R;
    CT__ti_sysbios_family_arm_cc26xx_TimestampProvider_useClockTimer ti_sysbios_family_arm_cc26xx_TimestampProvider_useClockTimer__R;
    xdc_SizeT ti_sysbios_knl_Event_Instance_State_pendQ__O;
    CT__ti_sysbios_knl_Task_allBlockedFunc ti_sysbios_knl_Task_allBlockedFunc__R;
    CT__ti_sysbios_family_arm_m3_Hwi_E_hardFault ti_sysbios_family_arm_m3_Hwi_E_hardFault__R;
    CT__ti_sysbios_knl_Mailbox_Object__count ti_sysbios_knl_Mailbox_Object__count__R;
    CT__xdc_runtime_Text_nameStatic xdc_runtime_Text_nameStatic__R;
    CT__ti_sysbios_family_arm_m3_Hwi_E_debugMon ti_sysbios_family_arm_m3_Hwi_E_debugMon__R;
    CT__ti_sysbios_family_arm_m3_Hwi_E_svCall ti_sysbios_family_arm_m3_Hwi_E_svCall__R;
    xdc_SizeT ti_sysbios_knl_Clock_Module_State_clockQ__O;
    CT__xdc_runtime_SysCallback_readyFxn xdc_runtime_SysCallback_readyFxn__R;
    CT__xdc_runtime_Text_unnamedModsLastId xdc_runtime_Text_unnamedModsLastId__R;
    CT__ti_sysbios_knl_Task_defaultStackSize ti_sysbios_knl_Task_defaultStackSize__R;
    xdc_runtime_Types_Base xdc_runtime_IGateProvider_Interface__BASE__R;
    CT__ti_sysbios_family_arm_m3_Hwi_E_hwiLimitExceeded ti_sysbios_family_arm_m3_Hwi_E_hwiLimitExceeded__R;
    CT__xdc_runtime_Startup_startModsFxn xdc_runtime_Startup_startModsFxn__R;
    xdc_SizeT ti_sysbios_knl_Semaphore_Instance_State_pendQ__O;
    CT__xdc_runtime_System_extendFxn xdc_runtime_System_extendFxn__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_family_arm_m3_Hwi_Object__DESC__R;
    CT__xdc_runtime_Text_nameEmpty xdc_runtime_Text_nameEmpty__R;
    CT__ti_sysbios_family_arm_m3_Hwi_Object__count ti_sysbios_family_arm_m3_Hwi_Object__count__R;
    CT__xdc_runtime_Text_visitRopeFxn xdc_runtime_Text_visitRopeFxn__R;
    CT__xdc_runtime_SysCallback_abortFxn xdc_runtime_SysCallback_abortFxn__R;
    CT__ti_sysbios_knl_Task_defaultStackHeap ti_sysbios_knl_Task_defaultStackHeap__R;
    CT__ti_sysbios_family_arm_m3_Hwi_E_usageFault ti_sysbios_family_arm_m3_Hwi_E_usageFault__R;
    CT__ti_sysbios_family_arm_m3_Hwi_ccr ti_sysbios_family_arm_m3_Hwi_ccr__R;
    CT__ti_sysbios_heaps_HeapTrack_Module__id ti_sysbios_heaps_HeapTrack_Module__id__R;
    CT__ti_sysbios_heaps_HeapMem_E_memory ti_sysbios_heaps_HeapMem_E_memory__R;
    CT__ti_sysbios_family_arm_m3_Hwi_E_memFault ti_sysbios_family_arm_m3_Hwi_E_memFault__R;
    CT__ti_sysbios_knl_Task_Object__count ti_sysbios_knl_Task_Object__count__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_heaps_HeapMem_Object__DESC__R;
    CT__xdc_runtime_Text_nameUnknown xdc_runtime_Text_nameUnknown__R;
    CT__xdc_runtime_Memory_defaultHeapInstance xdc_runtime_Memory_defaultHeapInstance__R;
    xdc_SizeT ti_sysbios_knl_Mailbox_Instance_State_freeQue__O;
    CT__xdc_runtime_Startup_sfxnTab xdc_runtime_Startup_sfxnTab__R;
} CT__constStruct;


/* TROM__stateStruct */
typedef struct {
    ti_sysbios_knl_Clock_Module_State__ ti_sysbios_knl_Clock_Module__state__V;
    ti_sysbios_family_arm_cc26xx_TimestampProvider_Module_State__ ti_sysbios_family_arm_cc26xx_TimestampProvider_Module__state__V;
    xdc_runtime_Startup_Module_State__ xdc_runtime_Startup_Module__state__V;
    xdc_runtime_Registry_Module_State__ xdc_runtime_Registry_Module__state__V;
    ti_sysbios_BIOS_Module_State__ ti_sysbios_BIOS_Module__state__V;
    ti_sysbios_knl_Swi_Module_State__ ti_sysbios_knl_Swi_Module__state__V;
    ti_sysbios_knl_Task_Module_State__ ti_sysbios_knl_Task_Module__state__V;
    xdc_runtime_Memory_Module_State__ xdc_runtime_Memory_Module__state__V;
    xdc_runtime_System_Module_State__ xdc_runtime_System_Module__state__V;
    ti_sysbios_family_arm_m3_Hwi_Module_State__ ti_sysbios_family_arm_m3_Hwi_Module__state__V;
    ti_sysbios_family_arm_cc26xx_Timer_Module_State__ ti_sysbios_family_arm_cc26xx_Timer_Module__state__V;
} TROM__stateStruct;

